server/app/controllers/poems_controller.rb

    def index
        render json: { poems: Poem.all }
---
SELECT "poems".* FROM "poems"

    def show
        @poem = Poem.find(params[:id])
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def create
        @poem = Poem.new(poem_params)
        if @poem.save
---
INSERT INTO "poems" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "A"], ["content", "bkjhkhkh"], ["created_at", "2018-09-12 14:41:33.885786"], ["updated_at", "2018-09-12 14:41:33.885786"], ["user_id", 1]]

    def update
        @poem = Poem.find(params[:id])
        if @poem.update(poem_params)
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "poems" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "poems"."id" = $4  [["title", "DALE"], ["content", "BITCH"], ["updated_at", "2018-09-14 02:47:07.768839"], ["id", 12]]

    def destroy
        @poem = Poem.find(params[:id])
        @poem.destroy
---
SELECT  "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "poems" WHERE "poems"."id" = $1  [["id", 9]]