server/app/controllers/users_controller.rb

  def index         #R
    render json: { users: User.all }, include: :poems   # Not sure if I need the `include` here
---
SELECT "poems".* FROM "poems" WHERE "poems"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users"